Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: При установке синтаксиса JavaScript область кода выражения должна содержать скрипт JavaScript.
en: When installing the JavaScript syntax, the expression code area must contain JavaScript.

source: При установке флага Игнорировать пустые значения обработчик не будет включать в результирующий набор строки с пустыми значениями в транспонируемых полях.
en: When selecting Skip null values checkbox, the handler won't include the strings with null values in the transposed fields into the resulting data set.

source: При установлении флага становится доступен для настройки блок параметров Автоматическое определение числа кластеров.
en: The following pack of parameters becomes available for configuration when selecting the checkbox: Auto Determination of Clusters Count.

source: При формировании выборки пользователь может задать метод отбора: случайный; равномерный случайный; стратифицированный; последовательный; отбор со смещением.
en: When creating the sample, a user can set the sampling method: random, random uniform, stratified, sequence, biased sampling.

source: При формировании текста SQL запроса существует возможность использования значений переменных входного порта, что позволяет оптимизировать обработку запросов и более гибко настроить работу с базой данных.
en: When finalizing the SQL query text, it is possible to use values of the input port variables that enables to improve processing of queries and provide flexible database use.

source: При этом будет учитываться тип переменной, например строка будет обрамлена кавычками.
en: The variable type will be taken into account in this case, for example, the string will be in quotation marks.

source: При этом в зависимости от настроек параметра Дополнение до наибольшего набора значение присоединенной переменной будет добавлено:
en: In this case, according to the settings of Missing Terminal Rows Filling parameter, the value of the joined variable will be added:

source: При этом в публикуемом в качестве веб-сервиса узле пакета реализуется логика обработки данных запроса к веб-сервису.
en: In this case, the logics of data processing of the request to the web service is implemented in the package node published as a web service.

source: При этом выполняются только сам указанный в параметрах узел и все предшествующие ему узлы — то есть все узлы, которые участвуют в формировании входных данных для него.
en: In this case, only the node specified in the parameters and all its preceding nodes , namely, all the nodes that take part in generation of the input data for it are executed.

source: При этом выполняются указанный узел и все предшествующие ему узлы — то есть все узлы, которые необходимо выполнить для формирования его входных данных.
en: In this case, the specified node and all preceding nodes are executed, namely, all nodes that must be executed for generation of its input data.

source: При этом данный параметр отдельно задается для выбросов и для экстремальных значений.
en: In this case, this parameter can be separately set for outliers and exreme values.

source: При этом для учета случаев, когда несколько сетей показывают сравнимые по точности результаты, в целях выбора сети с самой простой структурой значение целевой функции дополнительно штрафуется на слабо отличающийся от единицы множитель (1+1e-8) за каждый скрытый нейрон.
en: Under these circumstances, to take into account the cases when several networks provide the results comparable in accuracy, in order to select the network with the simplest structure, the target function value is additionally fined by the multiplier (1+1e-8) slightly different from 1 for each hidden neuron.

source: При этом есть возможность выбрать очередность, по которой сперва выбираются данные для тестового множества, потом для обучающего, или наоборот.
en: In this case, it is possible to select the order in which the data is selected first for the test set and then for the training one, or vice versa.

source: При этом заголовки выбранных столбцов переносятся в значения строк, а их данные — в один столбец.
en: In this case, headers of the selected columns are moved to the values of rows, and their data is moved to one column.

source: При этом изменить его в библиотеке функций нет возможности, поскольку сработает механизм наследования, и это может привести к ошибкам во всех сценариях, где он применяется.
en: At the same time, it is not possible to change it in the library of functions because the inheritance mechanism will be activated. It can cause errors in all workflows where it is applied.

source: При этом каждая запись исходного набора соединяется с записью такого же порядкового номера дополнительного набора.
en: In this case, each record of the source data set is joined with the record of the additional data set with the same order number.

source: При этом максимальное число строк для отображения 200.
en: The maximum row count to be displayed is 200.

source: При этом не могут быть использованы пустое имя пользователя или пустой пароль, так как такой пользователь должен получать анонимный доступ (в этом случае сразу выдается ошибка "Неверное имя пользователя или пароль");
en: In this case, it is not allowed to use the empty username or empty password as such user must get the anonymous access (otherwise, the following error is shown at once: "Invalid username or password").

source: При этом параметр «Количество рестартов» игнорируется.
en: In this case, the "Number of restarts" parameter is ignored.

source: При этом порядок будет указан цифрой в заголовке.
en: In this case, a figure in the caption will be used to specify the order.

source: При этом произойдет переход на панель управления отчетами.
en: In this case, these actions will enable to move to the reports control panel.

source: При этом промежуточные вычисления не хранятся в памяти компьютера и пересчитываются каждый раз, когда такая необходимость возникает.
en: In this case, the intermediate calculations are not kept in the computer memory, and they are recalculated each time when it is required.

source: При этом создастся узел сценария, выполняющий действие импорта.
en: In this case, the workflow node responsible for import is created.

source: При этом число классов рассчитывается на 1 больше, т.к. учитывается класс, включающий значения выше последней границы.
en: In this case, count of classes is calculated with one more class, as it is required to take into account the class that includes the values exceeding the last bound.

source: При этом, в отличии от команды "Связать автоматически" список выходных полей/переменных может быть изменен алгоритмом синхронизации и могут быть добавлены новые связи.
en: In this case, as opposed to "Auto link" command, the list of the output fields/variables can be changed by the synchronization algorithm, and new links can be added.

source: При этом, если замена не будет произведена, то тип не поменяется (за исключением / кроме случая замены вещественного числа на целочисленное).
en: In this case, if replacement is not performed, the type will not be changed (with the exception / apart from replacement of the real number with the integer one).

source: При этом, если начальное значение регуляризации задано, то используется оно, в противном случае регуляризация отключена.
en: In this case, if the initial decay value is set, it can be used, otherwise, the decay option is disabled.

source: Признак массив показывает, что в пределах одного родительского узла может содержаться более одного экземпляра данного узла.
en: The array indicator shows that more than one instance of such node can be included into one parent node.

source: Приключен%
en: Adventures%

source: Применение допустимого интервала
en: Use of the Allowable Interval

source: Применение параметров в запросах
en: Use of Parameters in Requests

source: Применение переменных в запросах
en: Use of Variables in Queries

source: Применение последнего более предпочтительно.
en: It is preferable to use the latter.

source: Применение фильтра может привести к сокрытию колонки/строки, если все составляющее ее ячейки не прошли фильтр.
en: Usage of filter can hide column/row if all constituents of its cell have not passed filtering.

source: Применение этого формата обеспечивает максимальную скорость при выполнении импорта и/или экспорта данных.
en: Such format provides the highest data import and/or export speed.

source: Применим автокорреляционный анализ к полю "Продано билетов в кино, тысяч шт.", задав ему параметр "Используемое" в настройках входного порта.
en: The autocorrelation analysis is applied to the following field: "Sold cinema tickets, thousand pieces". It is required to set "Used" parameter in the input port settings.

source: Применяется для борьбы с переизбыточностью данных, когда независимые переменные коррелируют друг с другом (мультиколлинеарность), вследствие чего проявляется неустойчивость оценок коэффициентов линейной регрессии.
en: It is used to avoid data redundancy when independent variables correlate with each other (multicollinearity) that causes instability of estimates of linear regression coefficient.

source: Применяется для оценки предполагаемой зависимости факторов.
en: It is used to access the supposed dependence of factors.

source: Применяется для построения пользовательской модели авторегрессии вида Прогноз = С + A0 * X(t) + A1 * X(t-1) + ...
en: It is used for construction of the user model of the following autoregression type: Prediction = С + A0 * X(t) + A1 * X(t-1) + ...

source: Применяется для построения пользовательской модели простого скользящего среднего в пользовательских моделях.
en: It is used for construction of the user model of the simple moving average in the user models.

source: Применяется для построения пользовательской модели экспоненциально сглаженного скользящего среднего.
en: It is used for construction of the user model of the exponentially smoothed moving average.

source: Применяются такие методы, как заполнение пропусков, сэмплинг, редактирование выбросов и другие.
en: Such methods as imputation, sampling, outliers elimination, etc. are applied.

source: Пример
en: Example

source: Пример 1.
en: Example 1.

source: Пример 2.
en: Example 2.

source: Пример вычисления степени числа:
en: Example of calculation of the number power:

source: Пример комментария:
en: The comment example:

source: Пример логики алгоритма с применением интервала:
en: The algorithm logics example with interval use:

source: Пример логики алгоритма:
en: The algorithm logics example:

source: Пример макроподстановки:
en: Example of macro substitution:

source: Пример настройки последовательности выполнения узлов см.
en: Example of configuration of the nodes execution order is provided

source: Пример с использованием данных:
en: Data use example:

source: Пример сложного условия:
en: The complex criterion example:

source: Пример создания директории через командную строку:
en: Example of the directory created via the command line:

source: Пример таблицы внешнего разбиения
en: Example of the External Binning Table

source: Пример: http://localhost/lgi/service.svc/rest/help
en: Example: http://localhost/lgi/service.svc/rest/help

source: Пример: http://localhost/lgi/service.svc?wsdl
en: Example: http://localhost/lgi/service.svc?wsdl

source: Пример: new Date(2020, 1, 5);
en: For example: new Date(2020, 1, 5);

source: Пример: new Date(2020, 1, 5, 13, 12, 50, 100).
en: For example: new Date(2020, 1, 5, 13, 12, 50, 100).

source: Примерами непрерывных данных являются: рост, вес, количество товара, прибыль и т.д.
en: There are the following examples of the continuous data: height, weight, quantity of goods, profit, etc.

source: Примеров в обучающем множестве
en: Samples in the training set

source: Примеров в обучающем множестве (TrainSamples)
en: Samples in training set (TrainSamples)

source: Примером такого правила служит утверждение, что покупатель, приобретающий 'Хлеб' (условие правила), купит и 'Молоко' (следствие правила) с вероятностью 75%.
en: To provide an example of such rule, it is observed that a consumer who buys "Bread" (condition of rule), will buy "Milk" as well (consequence of rule) with a probability of 75%.

source: Примеры
en: Examples:

source: Примеры использования
en: Examples of use:

source: Примеры использования переменных:
en: Examples of the variables use:

source: Примеры использования управляющих переменных:
en: Examples of the control variables use:

source: Примеры использования функций:
en: Examples of the functions use:

source: Примеры фактов — цена товара или изделия, их количество, сумма продаж или закупок, зарплата сотрудников, сумма кредита, страховое вознаграждение и т.д.
en: Examples of measures: price of product or item, their number, amount of sales or purchase, salary of employees, credit value, insurance compensation, etc.

source: Примеры формата даты: "DD.MM.YY" - преобразует дату в формат "день.месяц.год" ("25.12.04") "MM/DD/YYYY" - преобразует дату в формат "месяц.день.год" ("12/25/2004")
en: Examples of the date format:: "DD.MM.YY" - converts the date into the "day.month.year" format ("25.12.04") "MM/DD/YYYY" - converts the date into the "month.day.year" format ("12/25/2004")

source: Примеры формата даты: "DD.MM.YY" - преобразует дату в формат "день.месяц.год" ("25.12.04") "MM/DD/YYYY" - преобразует дату в формат "месяц.день.год" ("12/25/2004") Примеры формата времени: "H:NN" - преобразует время в формат "часы:минуты" ("9:53") "HH:NN:SS" - преобразует время в формат "часы:минуты:секунды" ("09:05:53")
en: Examples of the date format: "DD.MM.YY" - converts the date into the "day.month.year" format ("25.12.04") "MM/DD/YYYY" - converts the date into the "month.day.year" format ("12/25/2004") Examples of the time format: "H:NN" - converts the time into the "hours:minutes" format ("9:53") "HH:NN:SS" - converts the time into the "hours:minutes:seconds" format ("09:05:53")

source: Примеры формата: "DD.MM.YY" - говорит, что Аргумент содержит строки вида "25.12.04"; "DD/MM/YY/HH:NN:SS" - говорит, что Аргумент содержит строки вида "25/12/04/12:44:54";
en: The format examples: "DD.MM.YY" - means that the Argument contains strings of the following type: "25.12.04"; "DD/MM/YY/HH:NN:SS" - means that the Argument contains strings of the following type: "25/12/04/12:44:54";

source: Примеры:
en: Examples:

source: Примечание
en: Note

source: Примечание: Колонки легенды откреплять нельзя, за исключением колонки Поддержка.
en: Note: It is not allowed to deselect Legend columns, with the exception of Support column.

source: Примечание: Панель фильтрации, Панель сравнения кластеров и Детализацию можно изменить в размерах, если потянуть за линию разделитель левой кнопкой мыши.
en: Note: Sizes of Filtration panel, Cluster comparison panel and Detailing can be changed by dragging the separator line with the left mouse button.

source: Примечание: Все колонки, кроме колонки Доля, можно сортировать.
en: Note: It is possible to sort all columns, with the exception of Rate column.

source: Примечание: Если одновременно включен режим Накопительная гистограмма и выбрана ячейка кластера Итого, то в данные из этого не будут добавлены в накопительную гистограмму (поскольку они соответствуют генеральной совокупности).
en: Note: If Cumulative histogram mode is enabled and at the same time Total cluster cell is selected, the corresponding data will not be added to the cumulative histogram (as it matches the universal set).

source: Примечание: Можно выделять только ячейки в пределах одного поля и одновременно может быть выделено не более 7 ячеек.
en: Note: It is possible to select only the cells within one field. It is possible to select not more than 7 cells at the same time.

source: Примечание: Непрошедшие фильтр ячейки имеют измененный стиль в таблице.
en: Note: The cells that have not passed filtering refer to the changed style in the table.

source: Примечание: Режим Накопительная гистограмма может быть включен, когда гистограммы имеют формат Абсолютные частоты или Относительные частоты, в формате Плотность вероятности опция отключается и недоступна.
en: Note: Cumulative histogram mode can be enabled when the histograms refer to Absolute frequencies or Relative frequencies formats. The option is disabled and is not available in Density (PDF) format.

source: Примечание: Текущее ограничение на количество столбцов для дискретной гистограммы в ячейке — 12.
en: Note: The current restriction of the column count for the discrete histogram in the cell — 12.

source: Примечание: при открытии любого пакета всегда создается файл с именем <Название_пакета>.lgp.lck.
en: Note: In the case of any package opening the file with the following name is created: <Package_name>.lgp.lck.

source: Примечание: при проведении математических операций над типом "Дата/время" (сложение, вычитание и т.д.) в результате может получиться вещественное число с дробной частью.
en: Note: In the result of the mathematical operations with the "Date/time" type (addition, subtraction, etc.), the real number with fractional part can be got.

source: Примечание: при этом также будут деактивированы все другие отчеты, которые находятся на деактивируемых узлах.
en: Note: In this case, all other reports located on the deactivated nodes will be also deactivated.

source: Принимает значение типа number или string.
en: It takes the value of the number or string type.

source: Принимает значение типа number.
en: It takes the value of the number type.

source: Принимает значение типов number или string.
en: It takes the value of the number or string types.

source: Принимает значения следующих типов: boolean, number, string, Date, null, undefined.
en: It takes the values of the following types: boolean, number, string, Date, null, undefined.

source: Принцип работы Хранилища данных
en: Data Warehouse Operation Principle

source: Принципы создания решений на основе собственных компонентов рассматриваются в статье Проектирование сценариев.
en: Principles of creation of the solutions based on own components are analysed in the Design of Workflows article.

source: Приоритет автоматической настройки:
en: Auto setup priority:

source: Приоритет меньше/больше факторов.
en: Less/more factors priority.

source: Приоритет точность/скорость.
en: Accuracy/speed priority.

source: Приоритет точные/недостоверные данные.
en: Exact/inexact data priority.

source: Присваивается по имени столбца, по которому рассчитывалось квантование
en: It is assigned by the column name by which binning was calculated

source: Присоединяемая таблица 2:
en: Joined table 2:

source: Присоединяемая таблица:
en: Joined table:

source: Присутствует для различных пакетов.
en: It is available for different packages.

source: Присутствует только для пользовательских пакетов.
en: It is available only for user packages.

source: Пробел.
en: Space.

source: Пробел;
en: Space

source: Проведем корреляционный анализ на основе небольшой таблицы, содержащей данные о количестве продаж четырех видов товаров по датам.
en: Let's perform the correlation analysis based on the small table that contains data on the sales number of four types of goods by dates.

source: Проведем факторный анализ небольшой таблицы, содержащей некоторые статистические данные по регионам:
en: Let's perform the factor analysis of the small table that contains some statistical data by regions:

source: Проверить — тестировать подключение;
en: Check — test connection;

source: Проверка Аутентификации пользователя проходит в два этапа:
en: Authentification of the user is checked in two steps:

source: Проверка по внешним ключам включена по умолчанию.
en: Check by foreign keys is enabled by default.

source: Проверка состояния канала связи сервера с клиентом реализуется с помощью специального сообщения, которое периодически отправляется клиенту в том случае, если в течение заданного интервала времени на сервер не приходит ни одного сообщения с клиента.
en: The state of the server and client connection channel is checked using the special message that is periodically sent to the client if no messages are sent to the server from the client during the set time interval.

source: Проверку соединения сервера с клиентом можно отключить, для этого необходимо стереть значение периода проверки, сохранить настройки и перезагрузить сервер.
en: It is possible to disable check of server and client connection. For this purpose, it is required to delete the check period value, save settings and restart the server.

source: Проверяет соответствие строки регулярному выражению.
en: Checks the string and regular expression matching.

source: Проверяет, является ли Аргумент пустым.
en: Checks whether the Argument is null.

source: Проводится на независимом (т.е. не использовавшемся для обучения и тестирования) валидационном множестве после обучения и тестирования модели.
en: It is performed on the basis of the independent validation set (namely, the set that has not been used for training and testing) after the model training and testing.

source: Проводится только на текущем наборе данных в соответствии с установленными лимитами.
en: It is performed only for the current data set according to the set limits.

source: Прогнозирование временных рядов
en: Time Series Prediction

source: Продажи, шт.
en: Sales, pieces

source: Продажи, шт.+1
en: Sales, pieces+1

source: Продажи, шт.-1
en: Sales, pieces-1

source: Продажи, шт.-2
en: Sales, pieces-2

source: Продано билетов в кино, тысяч шт.
en: Sold cinema tickets, thousand pieces

source: Продолжение границ - метод устранения искажений на границах ряда при сглаживании:
en: Bounds extension: the method is used to eliminate distortions on the series bounds while smoothing:

source: Продолжение нулями;
en: Zero padding

source: Продолжить обучение - установление данного флага позволяет начать переобучение модели не со случайных значений весов нейросети, а с полученных при последнем обучении.
en: Continue training: selection of this checkbox enables to start the model overfitting not from the random values of the neural network weights, but from the ones obtained during the last training.

source: Продолжить обучение — установление данного флага позволяет начать переобучение модели не со случайных значений весов Нейросети, а с полученных при последнем обучении.
en: Continue training: selection of this checkbox enables to start the model overfitting not from the random values of the Neural Network weights, but from the ones obtained during the last training.

source: Проект может объединять в себе несколько пакетов благодаря тому, что каждый пакет имеет возможность предоставлять свои объекты другим пакетам через механизм ссылок.
en: The project can include several packages due to the fact that each package can provide its objects to other packages using the link mechanism.

source: Проект может состоять из связанных между собой Пакетов — это возможно благодаря тому, что каждый пакет может предоставлять свои объекты другим пакетам через механизм ссылок.
en: The Project can consist of interconnected Packages. It is possible due to the fact that each package can provide its objects to other packages using the mechanism of references.

source: Производные компоненты
en: Derived components

source: Производный компонент можно создать из комбинации узлов сценария, реализующей произвольную логику обработки.
en: The derived component can be created from combination of the workflow nodes implementing the random processing logics.

source: Производный компонент можно создать из комбинации узлов сценария, реализующих произвольную логику обработки.
en: The derived component can be created from combination of the workflow nodes implementing the random processing logics.
